{
	"title": "Experience",
	"experience": [{
		"timeperiod": "Feb 2025 - current",
		"company": "Freelance",
		"title": "Web Designer & Developer",
		"website": "https://denisenadal.com",
		"description": "Design and development of websites and SaaS platforms for clients of all sizes. I specialize in building small, lightweight and responsive websites, online shops and blogs, and complex and flexible WordPress installations, including theme, widget and plugin development. ",
		"highlights": [
		]
	},{
		"timeperiod": "Mar 2024 - Feb 2025",
		"company": "EcoMap Technologies",
		"title": "Director of Product Design",
		"website": "https://ecomap.tech",
		"description": "I coached and mentored a team of designers, collaborated with engineers, product managers, sales and support, and acted as voice of the customer. As a detail-oriented leader, I enjoyed building cross-functional relationships with stakeholders and finding innovative solutions to challenging problems.",
		"highlights": ["Led customer discovery, backlog management and prioritization","Developed team processes to validate, build and test solutions.","Product manager for Pathways, a new feature which doubled engagement time and tripled user retention. Pathways was nominated for Product of the Year 2024 by Technical.ly Baltimore.","Led effort to create a new visual identity for our brand and website."
		]
	},{
		"timeperiod": "Aug 2022 - Mar 2024",
		"company": "EcoMap Technologies",
		"title": "Design Engineer",
		"website": "https://ecomap.tech",
		"description": "First UI/UX hire, responsible for developing UX design and UX research processes, and redesigning the EcoMap platform to optimize for usability and meeting user needs.",
		"highlights": ["Modernized app UI for the EcoMap platform, improving usability and trust.",
		"Design and front-end development for our AI-powered Ecosystem Chatbot"]
	},{
			"timeperiod": "Aug 2020 - current",
			"company": "FIFCO USA (Genesee Beer, Labatt USA & Seagram's Escapes)",
			"title": "Web Designer & Developer",
			"website": "https://www.fifcousa.com",
			"description": "Lead designer and developer for a suite of brand and corporate websites. Rapidly designing, prototyping, building, testing, and launching multiple web-based projects concurrently. Managing team project backlog, task assignment and prioritization.",
			"highlights": [
				"Design and develop a company intranet site, as well design intranet policies and training materials",
				"Design and front end development of an online conference and video hosting portal for use by our sales team",
                "Design and development for a holiday marketplace featuring black-owned businesses, that increased site traffic by 20%.",
				"Design and development for the #GeneSEENY web app, featuring seasonal outdoor activities and Genesee vendors. Written in JavaScript using Mapbox GL framework and a product data API."
			]
		},
		{
			"timeperiod": "Sept 2019 - March 2020",
			"company": "Pointman",
			"title": "UX Design & <br>Product Management",
			"website": "https://www.pointman.com",
			"description": "Managed the entire design process, from research, ideation, designing and testing prototypes for multiple desktop and mobile apps for HVAC contractors.  Assisted with managing product backlog and writing feature requirements. Joined an innovation team focused on discovering new product opportunities. ",
			"highlights": [
				"Use product analytics to track user engagement and feature performance",
				"Design new features and define product requirements",
				"Build wireframes & prototypes in Sketch & InVision",
				"Facilitate customer discovery sessions, design workshops, & lean experiments ",
				"Create user personas, customer journey maps, workflow diagrams",
				"Design new mobile-first UI and user workflows for existing Pointman app",
				"User research, competitive analysis and opportunity mapping for new products"
			]
		},
		{
			"timeperiod": "May 2018 - Sept 2019 ",
			"company": "Pointman",
			"title": "UX Design & <br>Front-End Engineering",
			"website": "https://www.pointman.com",
			"description": "Front End Engineering and UI/UX Design for the Pointman app, a suite of field management software and mobile app for HVAC contractors.",
			"highlights": [
				"Built wireframes & prototypes in Sketch & InVision",
				"Performed user testing of future designs and existing features",
				"Facilitated cross-functional, collaborative design & research processes",
				"Facilitated story mapping workshops for engineering ",
				"Developed a Sketch UI library to accelerate the speed of creating prototypes. ",
				"Created design delivery process to ensure each project has a single source of truth."
			]
		},
		{
			"timeperiod": "Dec 2016 - April 2018",
			"company": "Utah Tech University",
			"title": "Web Developer",
			"website": "https://dixie.edu",
			"description": "Primary developer for University websites. Responsible for designing and developing new themes and templates in WordPress. Began a design system & pattern library.",
			"highlights": [
				"Created web apps and services for various news feeds, calendars & course schedules.",
				"Conducted user testing and analytics to inform team priorities and focus.",
				"Used UX research to develop a new students page that increased traffic by 50%.",
				"Acted as project manager: coordinating projects, managing deadlines, resources, resolving bugs, collecting user feedback, etc."
			]
		},
		{
			"timeperiod": "Sept 2015 - Dec 2016 ",
			"company": "Utah Tech University",
			"title": "Head Intern,<br>Web Content Design",
			"website": "https://dixie.edu",
			"description": "Lead & mentor team of interns in designing, developing and maintaining 100+ University departmental and promotional websites and related content.",
			"highlights": [
				"Migrated over 10,000 pages into WordPress within 6 months",
				"Facilitated cross-functional, collaborative design & research processes",
				"Updated code to HTML5/CSS3 web standards.",
				"Acted as project manager: coordinating projects and communicating with clients."
			]
		}
	]
}